export default {
    cvE: {
        history: [{
            id: 1, title: '實習生', dt: '2015/1/2', comp: ''
        }, {
            id: 2, title: '', dt: '', comp: ''
        }],
        intro: ''
    },
    cvC: {
        history: [{
            id: 1, title: '助理軟體工程師', dt: '2016/02 - 2017/01', comp: '鼎新電腦股份有限公司'
        }, {
            id: 2, title: '全端工程師', dt: '2019/3 - 現在', comp: '亞洲志遠股份有限公司'
        }],
        intro: `
        您好，我是陳谷維，今年25歲，畢業於元智大學資管系，
        求學階段前往新店鼎新電腦實習一年，擔任助理軟體工程師，工作內容為協助軟體工程師及Web自動化測試、產品功能性是否正常運作、JSP表單設計及客戶端的除錯原因紀錄。
        實習過程讓我學到BPM(電子簽核)系統的運作、開發專案流程及測試情境製作。
        畢業服完憲兵義務役後，隻身前往澳洲增進自己的語言能力，
        在澳洲期間深入了解當地生活型態與養成創新與不同的思考模式，除了增進語文能力外，跳脫自己框架的思考能力、學習到澳洲規律、守時與法治，
        集體合作及文化差異下的多元國際觀。回來後，前往中和亞洲志遠股份有限公司，在這期間學到更多關於協作、溝通及技術。
        
        以下是我的近期工作經驗簡述:
        
        1.前端設計:
                React ES6開發及Css設計,利用Redux將Data記錄下來並利用Ajax傳至後端處理
        2.後端設計:
                C# MVVM架構，將資料商業邏輯處理存進資料庫(MS SQL)
        3.API Webservice接口:
                開啟接口，利用API或是Webservice使其存取資料，RESTful API與其他公司介接資料 
                
        個人對於學習新的事物特別感興趣，如今仍持續精進自己，目前正著手學習React Native及 MongoDB(NoSQL架構)、Styled-components(ES6 css)、Node.js(Express)等等，
        進入職場學習到了更多關於協作及開發上所會面臨的問題，版控、商業邏輯、系統架構、程式維運，在任何層面上都必須思考縝密，才會減少多次修正的時間，
        與同事間須配合得宜，才會減少溝通上的摩擦及增加工作的效益。
        
        謝謝您的耐心觀看，我很期待與您的會面。
        谷維 `
    }
}